3A/SE350/IO-Management-Disk-Scheduling.tex
% Created 2024-04-09 Tue 02:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{IO Management and Disk Scheduling}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={IO Management and Disk Scheduling},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{IO Devices}
\label{sec:orgcdac499}
IO device categories are:
\begin{enumerate}
\item \textbf{human readable}: for communicating with the computer user (printers, terminals, display, etc)
\item \textbf{machine readable}: for communicating with electronic equipment (disk drives, USB keys, etc)
\item \textbf{communication}: for communicating with remove devices (digital line drivers, modems)
\end{enumerate}

Difference between classes are:
\begin{itemize}
\item \textbf{data rate}: can have several orders of magnitude difference in data transfer rate
\item \textbf{application}: device use influences software, OS policy, and utilities
\item \textbf{complexity of control}: differences in control interface are filtered by the complexity
of the IO module that the controls the device
\item \textbf{unit of transfer}: data may be transferred as a stream of bytes or characters, or in
larger blocks
\item \textbf{data representation}: different data encoding schemes are used by different devices
including differences in character code and parity conventions
\item \textbf{error conditions}: the nature of errors, how they are reported, consequences, and available
response range differs between devices

Uniform approach to IO is difficult.
\end{itemize}
\section{Organization of the IO Function}
\label{sec:org3a5fe0c}
Techniques for performing IO:
\begin{enumerate}
\item \textbf{programmed IO}: processor issues IO command to a module (on behalf of a process), the process
busy waits for the operation to complete before proceeding
\item \textbf{interrupt-driven IO}: processor issues an IO command (on behalf of a process)
\begin{itemize}
\item if the IO instruction from the process is nonblocking, the process continues
\item if the IO instruction is blocking, the next instruction the processor executes is from the
OS, which puts the process in a blocking state and schedules another process
\end{itemize}
\item \textbf{direct memory access (DMA)}: a DMA module controls the exchange of data between main memory
and an IO module
\begin{itemize}
\item the processor sends a request for block data transfer to the DMA module, and is interrupted
after the entire block has been transferred
\item dominant in most computer systems
\end{itemize}
\end{enumerate}
\subsection{Evolution of the IO Function}
\label{sec:org6068354}
Evolutionary steps of the IO function have been:
\begin{enumerate}
\item processor directly controls device (microprocessor-controlled devices)
\item controller or IO module added, so processor uses programmed IO without interrupts, so the
processor becomes less connected from the specific details of external device interfaces
\item same configuration as 2, but with interrupts, so the processor does not spend time waiting
for an IO operation, increasing efficiency
\item IO module given direct control of memory with DMA, so it can move a block of data to/from
memory without the processor, except at the beginning and end of transfer
\item IO module is a separate processor with specialized instructions for IO
\begin{enumerate}
\item CPU directs the IO processor to execute to execute an IO program in main memory
\item the IO processor fetches and executes instructions without processor intervention, allows
the processor to specify a sequence of IO activities and to be interrupted only when
the entire sequence has been performed
\end{enumerate}
\item IO module has local memory, so a large set of IO devices can be controlled with minimal
processor involvement
\begin{enumerate}
\item IO processor takes care of most tasks involved in controlling terminals
\end{enumerate}
\end{enumerate}

With evolution, CPU is less involved in IO tasks, improving performance.

IO module in step 5 is an \textbf{IO channel}, IO module in step 6 is an \textbf{IO processor}.
\subsection{Direct Memory Access}
\label{sec:orgec049d6}
DMA unit can mimic processor and take control of system bus like a processor, to transfer data
to and from memory.

When the processor wishes to read or write a block of data, it issues a command to the DMA
module by sending the following info:
\begin{itemize}
\item whether a read or write is requested, using the read or write control line between the processor
and the DMA module
\item the address of the IO device involved, communicated on the data lines
\item the starting location in memory to read from or write to, communicated on the data lines and
stored by the DMA module in its address register
\item the number of words to be read or written, communicated via the data lines and stored in the
data count register
\end{itemize}

Processor does other work while the DMA module transfers the data block.
When the transfer finishes, the DMA module sends the processor and interrupt.

DMA configurations
\begin{itemize}
\item \textbf{single-bus, detached DMA}: all modules share the same system bus, where the DMA module
is a processor that uses programmed IO to exchange data between memory and IO modules,
which is inefficient as each transfer consumes 2 bus cycles (transfer request, then transfer)
\item \textbf{single-bus, integrated DMA/IO}: DMA logic can be part of an IO module or separate that controls
1+ IO modules
\item \textbf{IO bus}: connect IO modules to the DMA module using an IO bus, which reduces the number of IO
interfaces in the DMA module to 1 and is more expandable
\end{itemize}

For last 2 DMA configurations, the system bus is used by the DMA module only to exchange data with memory
and exchange control signals with the processor.
\section{Operating System Design Issues}
\label{sec:org165355e}
\subsection{Design Objectives}
\label{sec:orgcf6e5e1}
Objectives in designing IO:
\begin{itemize}
\item \textbf{efficiency} is important since IO operations are a bottleneck
\begin{itemize}
\item with multiprogramming, some processes are waiting on IO operations while others execute
\item swapping can bring in ready processes, but this is an IO operation
\end{itemize}
\item \textbf{generality} allows handling all devices in a uniform manner, in how processes view IO devices
and how the OS manages IO devices and operations
\begin{itemize}
\item can use a hierarchical, modular approach to the design of the IO function so devices only see
read, write, open, close, lock, unlock
\end{itemize}
\end{itemize}
\subsection{Logical Structure of the IO Function}
\label{sec:orgbea3f9c}
OS functions should be separated according to complexity, characteristic time scale, and
abstraction level.

For a local peripheral device with simple communication, the layers are:
\begin{itemize}
\item \textbf{logical IO}: deals with the device as a logical resource, managing general IO functions
on behalf of user processes using a device ID and simple commands (open, close, read, write)
\item \textbf{device IO}: requested operations and data are converted to IO instructions, channel commands, and
controller orders, buffering could be used to improve utilization
\item \textbf{scheduling and control}: queueing, scheduling, and control of IO operations, including interrupts
and IO status, interacts with IO module and device hardware
\end{itemize}

Communications device is the same, but with communication architecture rather than logical IO.

Structure for IO on a secondary storage device that supports a file system has device IO and
scheduling and control, but before these it also has:
\begin{itemize}
\item \textbf{directory management}: file names converted to IDs that reference files directly or through
file descriptor/index table, also concerned with user operations on directories
(add, delete, reorganize)
\item \textbf{file system}: deals with logical structure of files, access rights, and user operations
(open, close, read, write)
\item \textbf{physical organization}: logical references to files and records must be converted to physical
secondary storage addresses, accounting for device structure, includes allocation of secondary
storage space and main storage buffers
\end{itemize}
