3A/SE350/IO-Management-Disk-Scheduling.org
* IO Buffering
A process reading data waits on the IO operation to complete, which can interfere with swapping
decisions by the OS (otherwise data lost).
If paging used, the page containing the target locations must be locked into main memory.
Otherwise, could cause deadlock if process swapped out before IO operation begins, so process waits on IO
event and IO operation waits on process to be swapped in.

Same considerations for output operations.

Can avoid overheads and inefficiencies by performing input transfers in advance of requests and
output transfers after request, which is *buffering*.

*Block-oriented device* stores info in blocks of fixed size, transfers made one block at a time, so
data can be referenced by block number. (disks, USBs)

*Stream-oriented device* transfers data in and out as a stream of bytes. (terminals, printers, etc.)

** Single Buffer
When a user process issues an IO request, the OS assigns a buffer in the system portion of main
memory to the operation.

For block-oriented devices:
- input transfers made to the system buffer, which is moved into user space when the transfer
  completes
- another block is requested (reading ahead/anticipated input), since expected that block will
  eventually be needed
- unnecessary block only read at end of sequence
- speedup since process can process one block while next is read in
- process can be swapped out since input is in system memory
- OS must keep track of assignment of system buffers to user processes
- if IO and swapping are on same disk, makes no sense to queue disk writes to the same device

For stream-oriented devices:
- single buffering can be used line-at-a-time or byte-at-a-time
  - line-at-a-time for scroll-mode terminals, where buffer can hold a line
    - user process is suspended during input
    - user process places lines in the buffer and continue processing, so it is not suspended unless
      another line of output must be sent before the buffer is emptied
  - byte-at-a-time for forms-mode terminals
    - follows producer/consumer model

** Double Buffer
*Double buffering/buffer swapping*: assigns 2 system buffers to operations, where a process transfers
data to/from one buffer while the OS empties/fills the other

For block-oriented transfer, processor does not have to wait on IO, always an improvement over
single buffering.

For stream-oriented transfer, could again use line-at-a-time IO (no suspension for input or output,
unless process ahead of double buffers) or byte-at-a-time IO (no advantage over single buffer of
twice the length)

** Circular Buffer
Use more than 2 buffers, with each individual buffer being 1 unit in the circular buffer.

Better for bursty IO.

** Utility of Buffering
Smoothes peaks in IO demand, but does not allow indefinite high pace of IO demand.
All buffers eventually fill up and processor will have to wait after processing each
data chunk.

* Disk Scheduling
** Disk Performance Parameters
Disk IO operation depends on the computer system, the OS, and the nature of the IO channel and disk
controller hardware.

Disk rotates at constant speed, where for reads and writes, the head must be positioned at the
desired track and at the beginning of the desired sector on that track.

Track selection moves the head (moveable-head system) or electronically selects one head (fixed-head
system).

*Seek time*: time to position the head at the track (moveable-head system)

Once track is selected, disk controller waits until appropriate sector rotates to line up with head.

*Rotational delay/latency*: time for the beginning of the sector to reach the head

*Access time*: sum of seek time and rotational delay, time to get into position to read/write

*Transfer time*: time required for data transfer, time to move head over sector

Device waits in queue for device to be available, which could include other drives if device
shares IO channel(s). Seek starts after device and channel available.

Rotational positional sensing works by attempting to connect to the channel when the head reaches
the sector, if the control unit or channel is busy with another IO, then the head must rotate another
revolution (RPS miss)..

*** Seek Time
Consists of initial startup time and time taken to traverse tracks that must be crossed once access
arm is up to speed.

Traversal time includes settling time (time to confirm track ID).

*** Transfer Time
Depends on rotation speed of the disk:
$$
T = \frac{b}{rN}
$$
where $T$ is transfer time, $b$ is the number of bytes to be transferred, $N$ is the number of
bytes on a track, and $r$ is the rotation speed (revs/s).

Total average access time is
$$
T_{a} = T_{s} + \frac{1}{2r} + \frac{b}{rN}
$$
where $T_{s}$ is the average seek time.

*** Timing Comparison
Can have huge difference between sequential read access and random read access.

If requests are randomly selected, will get poor performance.

** Disk Scheduling Policies
In a multiprogramming environment, the OS maintains a queue of requests for each IO device.

*Random scheduling*: select items from queue in random order, gives poor performance, a
benchmark against which to evaluate other techniques

*** First-In-First-Out
Process queue items in sequential order.

More fair and works well if there are only a few processes with requests to clustered
file sectors.

Open approximates random scheduling if many processes compete for disk.

*** Priority
Can use priority to meet other objectives within the OS, rather than optimize disk
utilization.

Short batch jobs prioritized over longer computations allowing shorter jobs to be
flushed through system quickly.

Users might split jobs into small pieces to beat the system.

*** Last-In-First-Out
Tasking most recent request means less arm movement for moving through a sequential
file by taking advantage of locality, improving throughput and reducing queue lengths.

Could allow for starvation if it never gets to the head of the line again.

*** Shortest-Service-Time-First
Select the disk IO request that requires least movement of the disk arm.
Always choose minimum seek time (with tiebreaker for equal distances).

Does not guarantee minimum average seek time.

*** SCAN
Arm can only move in one direction and satisfy all requests in that route until it
reaches the last track or no more requests in that direction.
Direction is reversed and scan proceeds in opposite direction.

Prevents starvation.
Favours jobs whose requests are for tracks nearest to innermost and outermost tracks.
Favours latest-arriving jobs.

For usual request pattern, SCAN similar to SSTF.

Biased against area most recently traversed, so less locality.

*** C-SCAN
Scanning only in 1 direction, so when last track visited, arm returns to opposite end of
disk and scan begins again.

Reduced max delay for new requests.

