3A/SE350/IO-Management-Disk-Scheduling.tex
\subsubsection{N-step-SCAN and FSCAN}
\label{sec:orgc0daef5}
If 1+ processes have high access rate to 1 track, they can monopolize the device by
repeated requests.
Can be avoided by segmenting the disk request queue, with 1 segment at a time being
processed completely.

N-step-SCAN segments disk request queue into subqueues of length \(N\).
Subqueues are processed using SCAN.
New requests added to some other queue when queue is processed.
If \(<N\) requests are available at the end of a scan, they are processed with the next
scan.
For large \(N\), N-step-SCAN is SCAN, for \(N=1\), N-step-SCAN is FIFO.

FSCAN uses 2 subqueues.
When a scan begins, all requests are in 1 queue, with the other empty.
During the scan, all new requests put into other queue so new requests are deferred
until old are processed.
\section{RAID}
\label{sec:org22a3117}

\section{Disk Cache}
\label{sec:org97fc381}
A buffer in main memory for disk sectors.
\subsection{Design Considerations}
\label{sec:org1d680de}
When an IO request is satisfied from the disk cache, the data in the disk must be
delivered to the requesting process.
Done by transferring block within main memory from disk cache to user memory or
passing a pointer to the slot in disk cache (saves time).

When a new sector is brought into disk cache, an existing block must be replaced.
Most commonly used replacement algorithm is LRU, which can be implemented using
a stack of blocks or pointers.

Can also use \textbf{least frequently used} (LFU), where the block that has experienced
the fewest references is replaced.
Implemented by associating a counter with each block, and the block with smallest
count is replaced.

LFU less effective due to locality (many references to one block in burst, but
none afterwards).

Can be fixed with frequency-based replacement.
Based on LRU, where a certain portion of the top of the stack is the new section.
On cache hit, the referenced block is moved to the top of the stack.
If the block was already in the new section, its reference count is not
incremented, otherwise incremented by 1.
This results in reference counts for blocks that are repeatedly re-referenced
in a short interval remaining unchanged.
On a miss, a block from the old section is replaced, using count and LRU.

Problem with this strategy is that there is not a sufficiently long interval for
blocks aging out of the new section to build up reference count.

Can be fixed by having new, middle, and old sections.
Reference counts not incremented in new section, replacement only from old section.
Allows blocks to build up reference count before coming eligible for replacement.

Replacement can be:
\begin{itemize}
\item \textbf{on-demand}: sector replaced only when slot needed
\item \textbf{preplanned}: many slots released at a time, due to write back, can cluster writes
and minimize seek time
\end{itemize}
\subsection{Performance Considerations}
\label{sec:orgadb6c2f}
Miss ratio is a function of the size of disk cache.

LRU can outperform frequency-based replacement, though frequency-based replacement is
also superior.
Sequence of references and block size affect performance achieved.
\end{document}
